export interface ITableRows {
  num: number;
  name: string;
  subjects: number[];
}
export interface ITableProps {
  tableCells: string[];
  tableRows: ITableRows[] | undefined;
}
const createData = (num: number, name: string, subjects: number[]) => {
  return { num, name, subjects };
};
export const rows: ITableRows[] = [
  createData(1, 'Адилов Данил', [3, 3, 3, 4, 3, 3, 3, 3, 5, 3, 3, 4, 3, 3, 3]),
  createData(2, 'Амангельдиев Арман', [4, 4, 5, 4, 5, 5, 4, 4, 5, 4, 5, 5, 5, 5, 4]),
  createData(3, 'Аманов Умид', [3, 3, 5, 5, 4, 4, 3, 3, 5, 3, 3, 4, 4, 3, 4]),
  createData(4, 'Амонов Азамат', [5, 5, 4, 4, 5, 5, 4, 5, 5, 5, 5, 5, 5, 5, 5]),
  createData(5, 'Ганиев Акмаль', [3, 4, 5, 4, 4, 5, 3, 3, 4, 3, 3, 4, 4, 4, 4]),
  createData(6, 'Даулетбаев Бахтиер', [5, 5, 5, 4, 4, 4, 5, 5, 5, 5, 4, 4, 4, 4, 4]),
  createData(7, 'Жанибеков Бахтдаулет', [4, 5, 5, 4, 5, 4, 4, 4, 5, 3, 5, 5, 4, 5, 4]),
  createData(8, 'Жунаев Ахрор', [4, 4, 4, 5, 5, 4, 3, 3, 4, 3, 3, 5, 4, 4, 3]),
  createData(9, 'Зафаров Маъсуд', [4, 4, 4, 4, 5, 5, 4, 4, 5, 5, 4, 4, 3, 4, 4]),
  createData(10, 'Зиятдинов Владимир', [4, 5, 4, 5, 4, 5, 4, 4, 5, 4, 4, 4, 5, 4, 4]),
  createData(11, 'Каюмов Давид', [4, 5, 4, 5, 4, 4, 4, 5, 5, 4, 4, 4, 4, 4, 5]),
  createData(12, 'Ким Анна', [5, 5, 4, 5, 5, 5, 5, 5, 5, 4, 5, 5, 5, 4, 5]),
  createData(13, 'Коротков Алексей', [5, 5, 4, 4, 4, 4, 5, 5, 5, 4, 5, 4, 5, 5, 4]),
  createData(14, 'Косимбаев Санжар', [3, 4, 5, 4, 4, 4, 3, 3, 3, 3, 4, 4, 4, 4, 4]),
  createData(15, 'Куанишева Дамира', [5, 5, 5, 4, 5, 5, 4, 3, 4, 4, 5, 4, 5, 5, 5]),
  createData(16, 'Мамуров Бехзод', [3, 3, 5, 4, 4, 3, 3, 3, 3, 3, 3, 4, 4, 3, 4]),
  createData(17, 'Рахимбердиев Шермухаммад', [3, 3, 5, 4, 4, 4, 3, 3, 4, 4, 4, 4, 4, 3, 4]),
  createData(18, 'Рустамов Ислом', [4, 4, 5, 4, 5, 5, 5, 5, 5, 5, 5, 5, 3, 4, 4]),
  createData(19, 'Саламов Зуфар', [4, 4, 5, 4, 5, 5, 3, 3, 3, 4, 5, 5, 4, 5, 4]),
  createData(20, 'Трощанович Диана', [5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]),
  createData(21, 'Фарходов Саидазиз', [3, 3, 5, 3, 3, 3, 2, 2, 3, 2, 3, 4, 2, 2, 4]),
  createData(22, 'Хожиев Билолиддин', [3, 3, 5, 4, 5, 5, 3, 3, 3, 3, 3, 4, 4, 4, 4]),
  createData(23, 'Шайхайдаров Ильяс', [4, 4, 4, 5, 4, 4, 3, 3, 4, 3, 3, 3, 3, 4, 4]),
  createData(24, 'Шарипов Азиз', [4, 4, 4, 5, 5, 5, 4, 4, 5, 3, 5, 4, 5, 5, 4]),
];
export const cells: string[] = [
  '№',
  'Имя Фамилия',
  'Русский',
  'Литература',
  'Узбекский язык',
  'Английский язык',
  'История Узбекистана',
  'Всемирная История',
  'Алгебра',
  'Геометрия',
  'Информатика',
  'Физика',
  'Химия',
  'Биология',
  'Физическое воспитание',
  'ОГП',
  'НДПЮ',
];
